Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateCorniceIntegral Property
 Could not create integral wall sweep for wall instance. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateCorniceIntegral { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateCorniceIntegral As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateCorniceIntegral {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace